Revit 2027 API
ParameterTypeId.TagLeaderType Property
 "Leader Type": Deprecated. Replaced by TAG_LEADER_START_TYPE and TAG_LEADER_END_TYPE
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId TagLeaderType { get; }
Public Shared ReadOnly Property TagLeaderType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ TagLeaderType {
	ForgeTypeId^ get ();
}
static member TagLeaderType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace